[
  "คณะเภสัชศาสตร์ มหาวิทยาลัยสงขลานครินทร์",
  "นาง กัลยา บุญแปง",
  "นาง ฐิติชญาณ์ บุญพิพัฒพิรุณ (ล้านฟาร์มสุข)",
  "นาง ณัฏฐ์ทิพา อนันตสุข",
  "นาง รจนา บุลสถาพร (บ้านสวนบุลสถาพร)",
  "นาง สายชู วรรณรัตน์ โรซ่า",
  "นาง อรไพลิณ ใจภักดี",
  "นาง อัญชลี โชคชัยชำนาญกิจ",
  "นาง เขียว จอดนอก",
  "นาง เนตรดาว ประโคม (ชอคโกแลตซาลอน)",
  "นางกัญญา ตัชชนานุสรณ์ (บัลแกเรีย เทรดดิ้ง)",
  "นางช่อทิพย์ ยุวัฒนา ( ซี.ที.มาร์เก็ตติ้ง)",
  "นางณัฐธยาน์ ธนะฤทธิ์จิรโชติ (บารมี)",
  "นางภัฐ อมตะวัฒนะกิจ(ไลฟ์ แคร์ แลบบอราทอรีส์)",
  "นางรุ่งทิพย์ อโนทัย (รุ่งจิรกิจ)",
  "นางลักขณา เมืองทอง(จันทราเฮิร์บ)",
  "นางศศิกานต์ หอมสุคนธ์ (นีโอ-เฟซ คอสเมติกส์)",
  "นางสาว กานต์พิชชา อินทุ่ม",
  "นางสาว กุลจิรา พรหมสาขา ณ สกลนคร",
  "นางสาว ชนัญชิดา กิตติ์เกษม",
  "นางสาว ฌาณนพัฒน์ นาคะพงศ์พานิช",
  "นางสาว ณัฏฐณัญญา ธนาฒย์กุศลิน (พิงค์ สกิน แลบ 88)",
  "นางสาว ธัชชลัยย์ ตรีทานนท์",
  "นางสาว นภัค กมลวันพัชร",
  "นางสาว ปทิตตา จิตตั้งบุญญา (เจเฮิร์บส)",
  "นางสาว ปราณี จิตรอารีย์",
  "นางสาว ปุณยนุช บุษบารัตน์",
  "นางสาว พัชรีย์ ดิษฐเจริญ (เดอร์มา คาบาร่า)",
  "นางสาว พัทธ์ธีรา สรานุพงศ์",
  "นางสาว มัณฑนา บุญอินทร์",
  "นางสาว มาริสสา สุวรรณประกร",
  "นางสาว วาธินี คุณนา",
  "นางสาว วาริ อัครวิรโภคิน",
  "นางสาว ศยามล แก้ววิเศษ",
  "นางสาว สุวลี เกียรติ์กรัณย์",
  "นางสาว อมรรัตน์ สุวรรณรมย์",
  "นางสาว อรพรรณ วงศ์เครือวัลย์",
  "นางสาว อักษราณุช แก้วพิลา",
  "นางสาว เกษราวดี พยัคฆ์",
  "นางสาวกมลพัชร เงินขาว(กมลพัชร สมุนไพร)",
  "นางสาวกัญญ์สิริ ปินไชยพัฒน์ (ละอองทอง)",
  "นางสาวณัฐาภัณฑ์ เกียรติภูมิกุลจิร(สมุนไพรคชนารี)",
  "นางสาวธนาณัฐพัน ภิรมย์ธนพัต (แชมพูสนุนไพร)",
  "นางสาวธัญชนก สมสุขเจริญ(เฟรช เนเชอรัล บาย ตุ๊ก)",
  "นางสาวธัณรดี วิริยพรสวัสดิ์ (เอสเธอร์ สกินแคร์)",
  "นางสาวปิยพร พรพงษ์ (โซไวท์ 456)",
  "นางสาวพัณณิฏา นิยมธรรมรัตน์(พีต้า คอสเมติก)",
  "นางสาวพีริยา วงศ์จันทรวิรัช (อารมณ์ดี บอดี้)",
  "นางสาวภัทรานิษฐ์ กุลพิเชษฐ์วณิช (บ้านเธอแอง กรุ๊ปส์)",
  "นางสาวมุขมณี ธรรมโส( มีสุข สกิน เฮิร์ป)",
  "นางสาววทันยา ไชยลังกา (เฮิร์บ การ์เด้น)",
  "นางสาววรวรรณ บุญสร้อย (ไนซ์ สกินแคร์)",
  "นางสาววลีวัลย์ ภู่ประดิษฐ์",
  "นางสาวอภิชญา อภิโชคหิรัญนนท์ (ทูฟาร่า)",
  "นางสาวอรุณี ทองสว่าง (ชมรมศึกษาพันธุ์พืชไทย)",
  "นางสาวอัมพาพร สิงห์กา (ลลิน คอสเมติกส์)",
  "นางสาวอ้อมแก้วว์ ขาวสอาด(ธารแก้วว์ สมุนไพรไทย)",
  "นางสาวเสาวลักษณ์ ศรีบุรินทร์(เอสเจน้ำหอม)",
  "นางสุธิตา สุกุมลจันทร์(จันทร์ธารา)",
  "นาย คอยโร ยูเปาะนะ",
  "นาย ทศพร ทวีธนา",
  "นาย ธนวรรษ อติเปรมานนท์",
  "นาย ธีรวุฒิ ตั้งจิตการุญ",
  "นาย บุญลือ เนียมรินทร์",
  "นาย พสิษฐ์ ศักดิ์อนันต์",
  "นาย ภัทร์ หนังสือ (อิสเทิร์นเทค แลบบอลาทอรีส์)",
  "นาย รชต ไกรกังวาร (โซพ วิลเลจส์)",
  "นาย สืบพงษ์ แหล่งสนาม (น้ำหอม ณา)",
  "นาย อธิคม พันธุ์ประพันธ์",
  "นาย อภิลักษณ์ศิริ ธนาศิริประเสริฐ",
  "นาย อภิลักษณ์ศิริ ธนาศิริประเสริฐ (ไบโอ คอสเมติก กรุ๊ป ทู บี ริช)",
  "นาย อาทิตย์ จาตุรมงคล (ร้านสกินคอสเมติก เซ็นเตอร์)",
  "นายภาคย์ พันธ์ทวีทรัพย์ (เวลาริส)",
  "นายวีระพันธ์ ปันทะนา(บ้านรักบุญหอม)",
  "นายสมชัย วุฒิณรงค์ตระกูล (เพลลิเน่ แลบ)",
  "นายสัณห์ หนูนวล (เซฟท์เคมีและบรรจุภัณฑ์)",
  "นายอาทิตย์ คำสุข (เพอร์เฟค สกิน คอสเมติก)",
  "นายโฆษิต คงปาน (ธรรมชาติคัดสรร)",
  "บริษัท 24 ชั่วโมง อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท 2เอ็นเค เทรดดิ้ง (2017) จำกัด",
  "บริษัท 999 แลบบอราทอรี่ส์ จำกัด",
  "บริษัท 999 แลบส์ ครีเอทีฟ จำกัด",
  "บริษัท กราเซียส เจพีเอส กรุ๊ป จำกัด",
  "บริษัท กรีนฉัตร เนเจอรัล เฮิร์บ (ประเทศไทย) จำกัด",
  "บริษัท กรีนวูด ฮอสพิทอลลิตี้ จำกัด",
  "บริษัท กรุงเทพ เพอร์ฟูมเมอรี่ จำกัด",
  "บริษัท กลูมมิ่ง โกลบอล จำกัด",
  "บริษัท กวางดาว กรุ๊ป จำกัด",
  "บริษัท กัลเดอร์มา (ประเทศไทย) จำกัด",
  "บริษัท กัสโต้ สกินคอสแล็บ จำกัด",
  "บริษัท กากันท์ (ประเทศไทย) จำกัด",
  "บริษัท กานต์ระพี เฮอร์เบิล คอสเมติกส์ จำกัด",
  "บริษัท การอง มาร์เก็ตติ้ง จำกัด",
  "บริษัท การ์กัวร์ แล็บ จำกัด",
  "บริษัท กิฟฟารีน สกายไลน์ แลบบอราทอรี่ แอนด์ เฮลท์แคร์ จำกัด",
  "บริษัท กิมยาง อินเตอร์ จำกัด",
  "บริษัท กีรติ จำกัด",
  "บริษัท กู้ด พีเพิล เทรดดิ้ง จำกัด",
  "บริษัท กู๊ด ฟู้ด เทรดดิ้ง จำกัด",
  "บริษัท ก้องเทพ จำกัด",
  "บริษัท คงธนา เซอร์วิส จำกัด",
  "บริษัท คชเชอร์ วี เมด จำกัด",
  "บริษัท คราริซเซ เอสเธทิคส์ (ประเทศไทย) จำกัด",
  "บริษัท คริสตัล ไวบ์ เอสเธติคส์ จำกัด",
  "บริษัท คริสโก้ (ประเทศไทย) จำกัด",
  "บริษัท ครีมเมอรี่พลัส จำกัด",
  "บริษัท คลับ 21 (ประเทศไทย) จำกัด",
  "บริษัท ควอนตั้ม เฮลท์แคร์ (ไทยแลนด์) จำกัด",
  "บริษัท ควอลิตี้ พลัส ไบโอเมดเทค จำกัด",
  "บริษัท คว็อลลิตี้ แล็บ จำกัด",
  "บริษัท คอนเน็ต อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท คอมเพล็กชั่น ซายน์ จำกัด",
  "บริษัท คอมเม็ทส์ อินเตอร์เทรด จำกัด",
  "บริษัท คอลเกต-ปาล์มโอลีฟ (ประเทศไทย) จำกัด",
  "บริษัท คอสมา เมดิกา แลบบอราตอรีส์ จำกัด",
  "บริษัท คอสมา แล็บบอราทอรี่ จำกัด",
  "บริษัท คอสมาพรอฟ จำกัด",
  "บริษัท คอสมินา จำกัด",
  "บริษัท คอสลุคส์ จำกัด",
  "บริษัท คอสิคอล แลบอราทอรีส์ จำกัด",
  "บริษัท คอสเมด อินโนเวชั่น จำกัด",
  "บริษัท คอสเมด แอนด์ แอนไท-เอจจิ้ง จำกัด",
  "บริษัท คอสเมดิก้า อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท คอสเมดิวา จำกัด",
  "บริษัท คอสเมติก แลบ จำกัด",
  "บริษัท คอสเมทิสท์ จำกัด",
  "บริษัท คอสเมเนีย แลบอราทอรี่ส์ จำกัด",
  "บริษัท คอสเม่เซน จำกัด",
  "บริษัท คอสโนวา พลัสส จำกัด",
  "บริษัท คอสโม พรอฟ จำกัด",
  "บริษัท คอสโม โปรเกรส อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท คอสโมเดิร์น จำกัด",
  "บริษัท คอสโมเนชั่น จำกัด",
  "บริษัท คอสไซ แลบบอราทอรี่ จำกัด",
  "บริษัท คัลเล่อร์คอส จำกัด",
  "บริษัท คาร์มาร์ท จำกัด (มหาชน)",
  "บริษัท คาเซีย789 จำกัด",
  "บริษัท คาโอ อินดัสเตรียล (ประเทศไทย) จำกัด",
  "บริษัท คิง บิวตี้ ซัพพลาย จำกัด",
  "บริษัท คิง เพาเวอร์ คอร์ปอเรชั่น จำกัด",
  "บริษัท คิว คอสเทค แลบบอราทอรีส์ จำกัด",
  "บริษัท คิว คอสเน็ท จำกัด",
  "บริษัท คิวรอน จำกัด",
  "บริษัท คิสออฟบิวตี้ จำกัด",
  "บริษัท คุณหนึ่งการ์เดนอินเตอร์เนชันแนล จำกัด",
  "บริษัท คุณหนึ่งการ์เดนอินเตอร์เนชั่นแนล จำกัด",
  "บริษัท คูริโนะ (ประเทศไทย) จำกัด",
  "บริษัท คูล่า โฮลดิ้ง จำกัด",
  "บริษัท จอยเฮิร์บ จำกัด",
  "บริษัท จอลลี่อาย คอสเม่ เอเชี่ยน จำกัด",
  "บริษัท จอห์นสัน แอนด์ จอห์นสัน (ไทย) จำกัด",
  "บริษัท จันวาณิชย์ ซีเคียวริตี้ พริ้นท์ติ้ง จำกัด",
  "บริษัท จั่งวัฒนา กรุ๊ป จำกัด",
  "บริษัท จินเบสท์ คอสเมติก จำกัด",
  "บริษัท จี อีโค กัมปานี จำกัด",
  "บริษัท จีระกุลธนันต์ จำกัด",
  "บริษัท จีเอส ลักชัวรี่ (ประเทศไทย) จำกัด",
  "บริษัท จีเอสคิว (ไทยแลนด์) จำกัด",
  "บริษัท จีแอลซี ควีน (ไทยแลนด์) จำกัด",
  "บริษัท จีโอแมติค จำกัด",
  "บริษัท จุฬาอุตสาหกรรม จำกัด",
  "บริษัท จูน แลบอราทอรีส์ จำกัด",
  "บริษัท จูเนทตี้ แลบอราทอรีส์ จำกัด",
  "บริษัท จ้า อาย จำกัด",
  "บริษัท ฉี ซิง จำกัด",
  "บริษัท ชนะภูมิ จำกัด",
  "บริษัท ชลาลัย ริช กรุ๊ป จำกัด",
  "บริษัท ชาญกิจเทรดดิ้ง จำกัด",
  "บริษัท ชาริสม่า อินเตอร์ โปร จำกัด",
  "บริษัท ชาร์ม คอสเมท จำกัด",
  "บริษัท ชาร์ม คอสเมทติคส์ (ประเทศไทย) จำกัด",
  "บริษัท ชาร์มมิ่ง คอสเมติกส์ กรุ๊ป จำกัด",
  "บริษัท ชาร์มีเน่ แฟคตอรี่ จำกัด",
  "บริษัท ชาร์แมซ คอสเมด จำกัด",
  "บริษัท ชิเซโด้ (ไทยแลนด์) จำกัด",
  "บริษัท ชีวาดี โปรดักส์ จำกัด",
  "บริษัท ชูการ์ อายส์ บิวตี้ จำกัด",
  "บริษัท ช้างแก้ว เนเชอรัล จำกัด",
  "บริษัท ซันต้า มาร์เก็ตติ้ง แอนด์ เซอร์วิส จำกัด",
  "บริษัท ซัมมิท ควีน จำกัด",
  "บริษัท ซิกเนเจอร์ เฮลท์ แอนด์ คอสเมติกส์ จำกัด",
  "บริษัท ซิงไท่ เทรดดิ้ง จำกัด",
  "บริษัท ซินนามิก ซิ๊นส์ 1972 จำกัด",
  "บริษัท ซิลเวอร์ (ประเทศไทย) จำกัด",
  "บริษัท ซิสเตอร์ไนน์ทีน จำกัด",
  "บริษัท ซิสโก้ เกสท์ ซัพพลาย (ประเทศไทย) จำกัด",
  "บริษัท ซี จี บิวตี้ จำกัด",
  "บริษัท ซี เค เค โซฟ จำกัด",
  "บริษัท ซี แอนด์ บี (ประเทศไทย) จำกัด",
  "บริษัท ซี-แล็บ คอสเมติก จำกัด",
  "บริษัท ซี.เอ.บิวตี้ จำกัด",
  "บริษัท ซี.เอ.อาร์.อี. จำกัด",
  "บริษัท ซีซานเต้ ไบโอแล็บบอราทอรี่ จำกัด",
  "บริษัท ซีดับบลิวเจ อินโนเวชั่น จำกัด",
  "บริษัท ซีดับบลิวแอล แล็บ จำกัด",
  "บริษัท ซีบีดี เทรดดิ้ง จำกัด",
  "บริษัท ซีสวอน แลบบอราทอรีส์ จำกัด",
  "บริษัท ซีเอซี มาร์เก็ตติ้ง จำกัด",
  "บริษัท ซีเอ็น คอร์เปอร์เรชั่น จำกัด",
  "บริษัท ซีเอ็มเอช ไลฟ์ ไซเอ็นซ์ จำกัด",
  "บริษัท ซีโอเอสเอ็มเอเอ็กซ์ (ไทยแลนด์) จำกัด",
  "บริษัท ซุปส์สตาร์ จำกัด",
  "บริษัท ฑิตา กรุ๊ป จำกัด",
  "บริษัท ณัฐธรา บิสสิเนส จำกัด",
  "บริษัท ณิชาเม่ อินเตอร์ จำกัด",
  "บริษัท ดวงสิริ นีโอ คอสเมติกส์ จำกัด",
  "บริษัท ดอกเตอร์ คอสเมติค แลบ จำกัด",
  "บริษัท ดอกเตอร์ สกิน แลบบอราทอรีส์ จำกัด",
  "บริษัท ดองกิ (ประเทศไทย) จำกัด",
  "บริษัท ดับบลิวไอดี จีแอล (ไทยแลนด์) จำกัด",
  "บริษัท ดั๊บเบิ้ล เอ (1991) จำกัด (มหาชน)",
  "บริษัท ดารัณ พงศ์ จำกัด",
  "บริษัท ดาริน คอสเมติกส์ แล๊บบอราทอรี่ (ประเทศไทย) จำกัด",
  "บริษัท ดิ อาฟเตอร์นูน จำกัด",
  "บริษัท ดี คิว โอโล่ แอสเซท จำกัด",
  "บริษัท ดี อาร์ ที วาย จำกัด",
  "บริษัท ดี เวลธ์ เอ็กซ์คลูซีฟ จำกัด",
  "บริษัท ดี.เอช.เอ.สยามวาลา จำกัด",
  "บริษัท ดีพราวด์ เนเจอร์ แล็บ จำกัด",
  "บริษัท ดีพลัส อินเตอร์เทรด จำกัด",
  "บริษัท ดีพลัสไทย จำกัด",
  "บริษัท ดีว่า ซัพพลาย จำกัด",
  "บริษัท ดีเคเอสเอช (ประเทศไทย) จำกัด",
  "บริษัท ดีเอฟซี เฟอร์นิชชิ่ง (ประเทศไทย) จำกัด",
  "บริษัท ดีโอเค สกิน จำกัด",
  "บริษัท ดีไซ แลบอราทอรี่ จำกัด",
  "บริษัท ดู เดย์ ดรีม จำกัด (มหาชน)",
  "บริษัท ด๊อกเตอร์ บิม จำกัด",
  "บริษัท ตงซิง โฮเต็ล ซัพพลายส์ (ประเทศไทย) จำกัด",
  "บริษัท ทรอปิคานา ออยล์ จำกัด",
  "บริษัท ทรัพย์ไพศาล คอสเมท จำกัด",
  "บริษัท ทรัสตี้ เดอมาร์ แอนด์ คอสเมติคแคร์ จำกัด",
  "บริษัท ทรานโซลูชั่นส์ อินโนเวทีฟ แล็บบอราทอรี่ส์ จำกัด",
  "บริษัท ทรีซันส์วันดอเธอร์แล็บ จำกัด",
  "บริษัท ทัช ไดเวอร์เจนซ์ จำกัด",
  "บริษัท ทัชวัน จำกัด",
  "บริษัท ทานสุข อี-คอมเมิร์ซ จำกัด",
  "บริษัท ทาฮัน เทรดดิ้ง จำกัด",
  "บริษัท ทินนา คอสเมติค จำกัด",
  "บริษัท ทิพยโอสถสถาน จำกัด",
  "บริษัท ที เอส คอสเมติก จำกัด",
  "บริษัท ที.เอ็น.เอช.อิมพอร์ต แอนด์ เอ็กซ์พอร์ต จำกัด",
  "บริษัท ทีทีพี ซัพพลีเม้นส์ จำกัด",
  "บริษัท ทีนิคซ์ ไลฟ์ จำกัด",
  "บริษัท ทีพีซีเอส จำกัด (มหาชน)",
  "บริษัท ทีเอ็นพีคอสเมซูติคอล จำกัด",
  "บริษัท ทีเอ็นเคบิวตี้ จำกัด",
  "บริษัท ทีเอ็ม คอสเมซายน์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท ทีแอนด์เอ อินเตอร์แปซิฟิค จำกัด",
  "บริษัท ทีโอวี จำกัด",
  "บริษัท ท็อปเท็น บิวตี้ เทรดดิ้ง จำกัด",
  "บริษัท ท๊อป คอสโม กรุ๊ป จำกัด",
  "บริษัท ท๊อป เมดิคัล(2015) จำกัด",
  "บริษัท ธรรมรักษา อินเตอร์คอสเมติค จำกัด",
  "บริษัท ธาร แลบบอราทอรี จำกัด",
  "บริษัท ธีม เอท (ประเทศไทย) จำกัด",
  "บริษัท ธีโรเมียรส์ จำกัด",
  "บริษัท นริศรา เฮิร์บ แอนด์ บิวตี้ จำกัด",
  "บริษัท นัมเบอร์ เนชั่นนัล จำกัด",
  "บริษัท นารา ทรี จำกัด",
  "บริษัท นาราวรรณ แลบบอราทอรี่ แอนด์ เฮลท์แคร์ จำกัด",
  "บริษัท นาวา 8188 จำกัด",
  "บริษัท นาวี เอ จำกัด",
  "บริษัท นำทรัพย์ แลบบอราทอรีส์ (ประเทศไทย) จำกัด",
  "บริษัท นิกรเทคโนการเกษตร จำกัด",
  "บริษัท นิมิตใหม่ คอสเมติก จำกัด",
  "บริษัท นิวตริโน คอสเมโทโลจี จำกัด",
  "บริษัท นิวตัน อินเตอร์เทรด จำกัด",
  "บริษัท นิวทริน่า ไบโอเทค จำกัด",
  "บริษัท นิวนอร์มอลพลัส จำกัด",
  "บริษัท นีโอ เคมีคอล อินดัสตรี้ จำกัด",
  "บริษัท นีโอคอสเมด จำกัด",
  "บริษัท นีโอเซฟ คอสเมติก จำกัด",
  "บริษัท นูทริชั่น โปรเฟส จำกัด (มหาชน)",
  "บริษัท นูรี อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท น่ารัก-เทียร่า จำกัด",
  "บริษัท น้ำหอม รัญจวน จำกัด",
  "บริษัท น้ำหอมน้องมิวส์ 2010 จำกัด",
  "บริษัท บราติ อินเตอร์เทรด จำกัด",
  "บริษัท บริดจ์ เทรด (ประเทศไทย) จำกัด",
  "บริษัท บริ้ง คอสเมค จำกัด",
  "บริษัท บลิส แอนด์ โบทานิกส์ จำกัด",
  "บริษัท บอดี้แคร์ จำกัด",
  "บริษัท บอน-ซอง เทรดดิ้ง เซ็นเตอร์ จำกัด",
  "บริษัท บอร์น ทู บี ออร่า จำกัด",
  "บริษัท บัดเจ็ท ซัพพลาย จำกัด",
  "บริษัท บัวขาว สมุนไพร จำกัด",
  "บริษัท บัวเงินคอสเมติกส์ (ประเทศไทย) จำกัด",
  "บริษัท บางกอก คอสมิค จำกัด",
  "บริษัท บางกอก เฮลท์ กรุ๊ป จำกัด",
  "บริษัท บางกอก โซป จำกัด",
  "บริษัท บางกอกแล็ป แอนด์ คอสเมติค จำกัด (มหาชน)",
  "บริษัท บางนิน อีคอมเมิร์ซ จำกัด",
  "บริษัท บางปูเคมีเคิลส์ จำกัด",
  "บริษัท บาย การ์ตูน จำกัด",
  "บริษัท บาย-จันหอม จำกัด",
  "บริษัท บารามี แลบบอราทอรีส์ จำกัด",
  "บริษัท บิซิเนส อัลไลแอนซ์ กรุ๊ป (ประเทศไทย) จำกัด",
  "บริษัท บิลเลี่ยนทิ้งค์ จำกัด",
  "บริษัท บิวตี้ 888 จำกัด",
  "บริษัท บิวตี้ คลับ เอสเธติค จำกัด",
  "บริษัท บิวตี้ คอมมูนิตี้ จำกัด (มหาชน)",
  "บริษัท บิวตี้ คอสเมต จำกัด",
  "บริษัท บิวตี้ คูซีนแลบ จำกัด",
  "บริษัท บิวตี้ ซีเคร็ท ดีเวลลอปเม้นท์ จำกัด",
  "บริษัท บิวตี้ อินฟินิตี้ คอสเมติก (ประเทศไทย) จำกัด",
  "บริษัท บิวตี้ อีทีซี จำกัด",
  "บริษัท บิวตี้ แพสชั่น กรุ๊ป จำกัด",
  "บริษัท บิวตี้ครีเอทีฟ จำกัด",
  "บริษัท บิวตี้ดาราอินเตอร์เทรด จำกัด",
  "บริษัท บิวตี้เวลล์ เอ็กซ์เพิร์ท จำกัด",
  "บริษัท บิ๊กทรี คอสเมด จำกัด",
  "บริษัท บิ๊ค เคมิคอล จำกัด",
  "บริษัท บี ยู สกิน จำกัด",
  "บริษัท บีที แลบส์ เทรดดิ้ง จำกัด",
  "บริษัท บีทีเฮอเบิล จำกัด",
  "บริษัท บีบีพี อินฟินิตี้ คอสเมติก จำกัด",
  "บริษัท บีพีแล็บ จำกัด",
  "บริษัท บีฟอร์ มี จำกัด",
  "บริษัท บียอนด์ บิวตี้ เทรด จำกัด",
  "บริษัท บีออ คอสเมติก จำกัด",
  "บริษัท บีเคเค คอสเมติกส์ จำกัด",
  "บริษัท บีเนเชอรัลบิวตี้ จำกัด",
  "บริษัท บีเอเอส แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท บีเอ็นวาย บิวตี้ จำกัด",
  "บริษัท บีโอที โกลบอล กรุ๊ป จำกัด",
  "บริษัท บีไทม์ บิวตี้ เฮ้าส์ จำกัด",
  "บริษัท บุญภิญโญ จำกัด",
  "บริษัท บูมไบรท์กรุ๊ป จำกัด",
  "บริษัท บู๊ทส์ รีเทล (ประเทศไทย) จำกัด",
  "บริษัท บ้านสวนตามฝัน จำกัด",
  "บริษัท บ้านหมอละออง จำกัด",
  "บริษัท ปฐวิน จำกัด (มหาชน)",
  "บริษัท ประภาภูมิ โอสถ (ประเทศไทย) จำกัด",
  "บริษัท ปริยวิศว์ แล็บบอราทอรี่ จำกัด",
  "บริษัท ปัณณวิชญ์ แฟคตอรี่ กรุ๊ป จำกัด",
  "บริษัท ปารีส เอส เอ จำกัด",
  "บริษัท ปิ่นเพชร โกลบอล จำกัด",
  "บริษัท ป่ายเต๋อ จวี๋เย่ ไบโอเทคโนโลยี (ไทยแลนด์) จำกัด",
  "บริษัท ผลิตภัณฑ์สมุนไพร ดร. สาโรช จำกัด",
  "บริษัท พนัชกร คอสเมติกส์ (ไทยแลนด์) จำกัด",
  "บริษัท พบธรรมสมุนไพร จำกัด",
  "บริษัท พรทิน่าบิวตี้ จำกัด",
  "บริษัท พรรณเซนส์ คอสเมด จำกัด",
  "บริษัท พรอคเตอร์ แอนด์ แกมเบิล เทรดดิ้ง (ประเทศไทย) จำกัด",
  "บริษัท พรอคเตอร์ แอนด์ แกมเบิล แมนูแฟคเจอริ่ง (ประเทศไทย) จำกัด",
  "บริษัท พรีมา แคร์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท พร้อม คอปเปอเรท จำกัด",
  "บริษัท พฤกษชาติ 2019 จำกัด",
  "บริษัท พฤกษา แลบบอราเทอรี่ จำกัด",
  "บริษัท พลัส มอร์ 2016 จำกัด",
  "บริษัท พลัสแคร์แลบอินโนเวชั่น จำกัด",
  "บริษัท พลูโก (ไทยแลนด์) จำกัด",
  "บริษัท พสุธารา จำกัด",
  "บริษัท พันธ์วาดี จำกัด",
  "บริษัท พารากอน เอสเทติก จำกัด",
  "บริษัท พารากอนแคร์ (ไทยแลนด์) จำกัด",
  "บริษัท พาร์ทเนอร์ คอร์ปอเรท จำกัด",
  "บริษัท พาวเวอร์ริช คอสเมติกส์ จำกัด",
  "บริษัท พินนิค ซายน์เทค จำกัด",
  "บริษัท พิมพ์พิชชา จำกัด",
  "บริษัท พิริยพูล อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท พิเรเน่ กรุ๊ป จำกัด",
  "บริษัท พี เค คอสเมติก แอนด์ ดีเวลลอปเม้นท์ จำกัด",
  "บริษัท พี เอช ดี คอสเมโทโลยี จำกัด",
  "บริษัท พี แอนด์ เอ็น เวลธีเทรด จำกัด",
  "บริษัท พี.ที.อินโนเวชั่น จำกัด",
  "บริษัท พี.เจ. สกิน-พลัส แล็บ จำกัด",
  "บริษัท พี.เอส.วี. เคมีคอล จำกัด",
  "บริษัท พี.แอนด์.โอ. เฮลท์ตี้แคร์ จำกัด",
  "บริษัท พีคโซน กรุ๊ป จำกัด",
  "บริษัท พีที แฮร์ เอ็กซ์เปิร์ท จำกัด",
  "บริษัท พีทูเอส คอสเมติกส์ จำกัด",
  "บริษัท พีพี แคร์ จำกัด",
  "บริษัท พีพี โกลบอล อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท พีพีอี เบสท์ คอสเมติก จำกัด",
  "บริษัท พีเอ็มยู แลบบอราทอรี่ส์ จำกัด",
  "บริษัท พ้อยท์ คอสเมติคส์ จำกัด",
  "บริษัท ฟลอรอลแมนูแฟคเจอริ่งกรุ๊ป จำกัด",
  "บริษัท ฟลอรา ซีเค จำกัด",
  "บริษัท ฟลอร่า แคร์ จำกัด",
  "บริษัท ฟลอเลส ฮาร์ท จำกัด",
  "บริษัท ฟอร์ เดอะ เบส แล็บโบราโทรี่ จำกัด",
  "บริษัท ฟาร์ม สกิน อินโนเวชั่น แลบ จำกัด",
  "บริษัท ฟาร์มา เมดิคอล แอนด์ เฮลท์แคร์ กรุ๊ป จำกัด",
  "บริษัท ฟาร์สเป็ค จำกัด",
  "บริษัท ฟิลิปินเนียนา คอสเมติก จำกัด",
  "บริษัท ฟูลาเออร์ จำกัด",
  "บริษัท ฟูลเรย์ จำกัด",
  "บริษัท ภักดีเจริญพาณิชย์ จำกัด",
  "บริษัท ภาคิน เคมีภัณฑ์ จำกัด",
  "บริษัท ภูฐาปัญญาออกานิค จำกัด",
  "บริษัท ภูริศรา อินโนเวทีฟ จำกัด",
  "บริษัท มล คอสเมติค999 จำกัด",
  "บริษัท มัลตี้ บิวตี้ จำกัด",
  "บริษัท มัส ยู จำกัด",
  "บริษัท มาซามูเนะ คอสเมต จำกัด",
  "บริษัท มาตัง คอสเมติก จำกัด",
  "บริษัท มาย ทริป ลักเกจ จำกัด",
  "บริษัท มาย สกิน แล็บราทอรี่ จำกัด",
  "บริษัท มายกิ๊ฟท์ คอสเมติก จำกัด",
  "บริษัท มายด์แล็บสกิน แอนด์ คอสเมติกส์ จำกัด",
  "บริษัท มายา แคร์ แลบส์ จำกัด",
  "บริษัท มาร์ค ไบโอ แล็ปบอราทอรี่ จำกัด",
  "บริษัท มาร์คอัพ คอร์เปอร์เรชั่น จำกัด",
  "บริษัท มิทาเกะ จำกัด",
  "บริษัท มิราเคิล เฮ็ลธ์ แคร์ จำกัด",
  "บริษัท มิลเล่ (ไทยแลนด์) จำกัด",
  "บริษัท มิสครีม (ไทยแลนด์) จำกัด",
  "บริษัท มีมี่ ไวท์ คอร์ปอเรชั่น จำกัด",
  "บริษัท มีสตางค์มีทรัพย์ จำกัด",
  "บริษัท ยอคุณโอสถ จำกัด",
  "บริษัท ยองวอน บิวตี้ จำกัด",
  "บริษัท ยามาฮัทสึ (ประเทศไทย) จำกัด",
  "บริษัท ยาอินไทย จำกัด",
  "บริษัท ยู ซี บิวตี้ คอสเมติก จำกัด",
  "บริษัท ยู แคน บิวตี้ แล็บ จำกัด",
  "บริษัท ยู.บี.อุตสาหกรรมเคมี จำกัด",
  "บริษัท ยูนิลีเวอร์ ไทย เทรดดิ้ง จำกัด",
  "บริษัท ยูนิลีเวอร์ ไทย โฮลดิ้งส์ จำกัด",
  "บริษัท ยูนิเพอร์เฟ็คท์ อินเตอร์เนชั่นแนล คอสเมติคส์ จำกัด",
  "บริษัท ยูนิเวอร์ซัล เว็ลธี ไลฟ์ จำกัด",
  "บริษัท ยูเนียน คอสเทค กรุ๊พ จำกัด",
  "บริษัท ยูเรเซีย คอสเมติก จำกัด",
  "บริษัท ยูเฮิร์บ บิวตี้ จำกัด",
  "บริษัท ยูไนค์ ไบโอซูติกส์ จำกัด",
  "บริษัท ยูไนเต็ด โกลเบิล เอเยนซี (ประเทศไทย) จำกัด",
  "บริษัท รวยง่ายสบายด้วย จำกัด",
  "บริษัท รวยมั่งคั่ง 69 จำกัด",
  "บริษัท รอมมี จำกัด",
  "บริษัท รอยัล กรุ๊ป อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท รอยัล สยาม แกรนด์ พาราไดซ์ จำกัด",
  "บริษัท รอยัล ไบโอ โลจิคอล เทคโนโลยี จำกัด",
  "บริษัท รักษ์ดีดี โคโค่มิ้ลค์ จำกัด",
  "บริษัท รัฐสรณ์ เทรดดิ้ง จำกัด",
  "บริษัท ริช แอนด์ ฟัน จำกัด",
  "บริษัท ริชชี่เนเชอรัลออยล์ จำกัด",
  "บริษัท ริชมอนด์ ลักซ์ชัวรี (ประเทศไทย) จำกัด",
  "บริษัท ริชโกลด์ เทรดดิ้ง กรุ๊ป จำกัด",
  "บริษัท ริวไลฟ์ จำกัด",
  "บริษัท รีวานซ์ เมดดิก้า จำกัด",
  "บริษัท รีเซลล์ ไบโอเทคโนโลยี (ประเทศไทย) จำกัด",
  "บริษัท รีเทล ลากูน เอเชีย จำกัด",
  "บริษัท รีเอ็กซ์ โปรดักส์ จำกัด",
  "บริษัท รีโว่เมด กรุ๊ป จำกัด",
  "บริษัท รุจิรา สยามโฮลดิ้ง จำกัด",
  "บริษัท รุ่งจรูญ แอนด์ ซันส์ จำกัด",
  "บริษัท รุ่งอรุณคอสเมติกส์ จำกัด",
  "บริษัท รุ่งเรืองชัย 1998 จำกัด",
  "บริษัท รูเบียอุตสาหกรรม จำกัด",
  "บริษัท ร้อบบีมาร์เก็ต จำกัด",
  "บริษัท ลดา คอสเมติกส์ 2017 (ประเทศไทย) จำกัด",
  "บริษัท ลอยตี้ จำกัด",
  "บริษัท ลอรีอัล (ประเทศไทย) จำกัด",
  "บริษัท ลักกี้ เวย์ จำกัด",
  "บริษัท ลักซ์ซิคอน บิวเต้ จำกัด",
  "บริษัท ลักศมีล่า จำกัด",
  "บริษัท ลักส์มิน จำกัด",
  "บริษัท ลัคซ์เอเซีย (สยาม) จำกัด",
  "บริษัท ลา โบเตก้า (ไทยแลนด์) จำกัด",
  "บริษัท ลาซาโรส จำกัด",
  "บริษัท ลี แอนด์ โค คอสเมซูติคอล จำกัด",
  "บริษัท ลียาคอสเมติกส์ จำกัด",
  "บริษัท ลีเอ็นเตอร์เทนเม้นท์ จำกัด",
  "บริษัท ล็อกซิทาน (ประเทศไทย) จำกัด",
  "บริษัท วธูธร จำกัด",
  "บริษัท วรินดา อิมพอร์ต แอนด์ เอ็กซ์พอร์ต จำกัด",
  "บริษัท วันเดอร์ ไอ จำกัด",
  "บริษัท วารามัวร์ จำกัด",
  "บริษัท วาโย โปรดักส์ จำกัด",
  "บริษัท วิกกี้ เพอร์ฟูม จำกัด",
  "บริษัท วิน แอด จำกัด",
  "บริษัท วินด์ ซัพพลาย เชน วัน (ประเทศไทย) จำกัด",
  "บริษัท วินเนอร์กรุ๊ป เอ็นเตอร์ไพรซ์ จำกัด (มหาชน)",
  "บริษัท วิลล่า แลบบอราทอรี่ จำกัด",
  "บริษัท วิโอร่าไบโอ จำกัด",
  "บริษัท วิ้งส์คอสเมด จำกัด",
  "บริษัท วี ทู วี จำกัด",
  "บริษัท วี เอส 09 ออริจินอล เฮิร์บ จำกัด",
  "บริษัท วี แลบส์ จำกัด",
  "บริษัท วีชมาร์ต จำกัด",
  "บริษัท วีย์ เฮิร์บ แลบบอราทอรี่ จำกัด",
  "บริษัท วีรดา จำกัด",
  "บริษัท วีร่า อัลลายด์ แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท ศยาสมุนไพร จำกัด",
  "บริษัท ศริยา คอมเพล็กซ์ชั่น จำกัด",
  "บริษัท ศรีจันทร์สหโอสถ จำกัด",
  "บริษัท ศารายา อินเตอร์เนชั่นแนล (ไทยแลนด์) จำกัด",
  "บริษัท ศิริ แลบอราทอรีส์ จำกัด",
  "บริษัท ศิริณนา กรุ๊ป จำกัด",
  "บริษัท ศิริบัญชา จำกัด",
  "บริษัท สกายไฮ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท สกิน ทูเกทเธอร์ จำกัด",
  "บริษัท สกิน มายด์ คอสเม่ จำกัด",
  "บริษัท สกิน อินทิเมท จำกัด",
  "บริษัท สกิน อินเตอร์ แล็บ จำกัด",
  "บริษัท สกินคอสติก จำกัด",
  "บริษัท สกินอัส แอลโอซี จำกัด",
  "บริษัท สกินเทค อินเตอร์ โปรดักส์ จำกัด",
  "บริษัท สกินเน็กซ์ จำกัด",
  "บริษัท สกินโนวา จำกัด",
  "บริษัท สกินไบโอเทค (ประเทศไทย) จำกัด",
  "บริษัท สตาร์ ชายน์ มาร์เก็ตติ้ง จำกัด",
  "บริษัท สบาย โฮม สปา จำกัด",
  "บริษัท สปา โปรดักส์ ออฟ เอเซีย จำกัด",
  "บริษัท สปาชา บิวตี้ แอนด์ สลิม จำกัด",
  "บริษัท สมอล แครอท จำกัด",
  "บริษัท สมุนไพรภูมันตรา กระบี่ จำกัด",
  "บริษัท สมุนไพรสุภาภรณ์อิมปอร์ตเอ็กซปอร์ต จำกัด",
  "บริษัท สยาม พรีเมี่ยม อินเตอร์ จำกัด",
  "บริษัท สยาม อโรมา จำกัด",
  "บริษัท สยาม เดอร์มา โปร จำกัด",
  "บริษัท สยาม เทรด ซัพพลาย จำกัด",
  "บริษัท สยาม เทรด ดิวิลอปเมนท์ จำกัด",
  "บริษัท สยาม เนเชอรัล โปรดักซ์ จำกัด",
  "บริษัท สยาม ไบโอ ลาบอราทอรี่ส์ จำกัด",
  "บริษัท สยาม ไบโอ โบทานิก้า จำกัด",
  "บริษัท สยามสำลี จำกัด",
  "บริษัท สยามเซนส์ จำกัด",
  "บริษัท สยามเนเจอร์ริช จำกัด",
  "บริษัท สยามเฮลท์ กรุ๊ป จำกัด",
  "บริษัท สยามโกลด์แลบโกล จำกัด",
  "บริษัท สยามโยโกะ จำกัด",
  "บริษัท สรรพสินค้าเซ็นทรัล จำกัด",
  "บริษัท สวยงามสกินแคร์ จำกัด",
  "บริษัท สวัสดี กรุ๊ป (ไทยแลนด์) จำกัด",
  "บริษัท สหมิตร โปรดักส์ จำกัด",
  "บริษัท สะดาญา คอสเมติก จำกัด",
  "บริษัท สานฝัน ออร์แกนิค จำกัด",
  "บริษัท สานิตแอนด์ซันส์ จำกัด",
  "บริษัท สุข เฮลท์ แอนด์ เวลเนส จำกัด",
  "บริษัท สุมัณตรา คอสเมติกส์ จำกัด",
  "บริษัท สุรทิณฑ์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท สุ่ยชิง จำกัด",
  "บริษัท สเปเชียลตี้ อินโนเวชั่น จำกัด",
  "บริษัท สแตนดาร์ด แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท สไปรูไลน่า (2004) โปรดักส์ จำกัด",
  "บริษัท สไมล์ ภัณฑ์ จำกัด",
  "บริษัท หยางหมิง อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท หยุนหลาน อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท หาญ โกลบอล จำกัด",
  "บริษัท หาดใหญ่ เซนท์ จำกัด",
  "บริษัท ห้าม้า เภสัช จำกัด",
  "บริษัท อควา โฮเทล ซัพพลาย จำกัด",
  "บริษัท อดามาส แลบบอราทอรี่ จำกัด",
  "บริษัท อมตะ ไลฟ์ พลัส จำกัด",
  "บริษัท อมาเบลล์ จำกัด",
  "บริษัท อมิที แลบบอราโทรี จำกัด",
  "บริษัท ออกานิกส์ คอสเม่ จำกัด",
  "บริษัท ออนรีซี่ มี จำกัด",
  "บริษัท ออนเนสท์ เทรดดิ้ง จำกัด",
  "บริษัท ออรัม เมดธ์ จำกัด",
  "บริษัท ออร่าซาลอนโปรเฟสชั่นนอลโปรดักส์ จำกัด",
  "บริษัท ออร์แกนิก ไวต้า จำกัด",
  "บริษัท ออล ไมโครเทค (ประเทศไทย) จำกัด",
  "บริษัท ออล-แพล้นท์ส อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท อะเบอร์แมร์รี่ จำกัด",
  "บริษัท อังกฤษตรางู (แอล.พี.) จำกัด",
  "บริษัท อังกฤษตรางู (แอล.พี.) สาย5 จำกัด",
  "บริษัท อัญญา อินโนเวต จำกัด",
  "บริษัท อันปัน อินดัสทรี จำกัด",
  "บริษัท อัปสรา คอสเมติก จำกัด",
  "บริษัท อากาฟาร์ เมดิคอล เซ็นเตอร์ (ประเทศไทย) จำกัด",
  "บริษัท อาคูทิส (ประเทศไทย) จำกัด",
  "บริษัท อาบอิ่มสปา จำกัด",
  "บริษัท อาย๊ะ จำกัด",
  "บริษัท อาร์ เอ็น อุตสาหกรรม จำกัด",
  "บริษัท อาร์ แอนด์ ดี รีเสิร์ช อินโนเวชั่น แอนด์ ซัพพลาย จำกัด",
  "บริษัท อาร์ แอนด์ ดี อินเตอร์ แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท อาร์ แอนด์ เอ็น อินเตอร์คอส จำกัด",
  "บริษัท อาร์กอซี่ คอสเมติกส์ จำกัด",
  "บริษัท อาร์คแอทริช จำกัด",
  "บริษัท อาร์เค ไบโอเทค จำกัด",
  "บริษัท อาร์เอวาย (ไทยแลนด์) จำกัด",
  "บริษัท อิงฟ้า อินเตอร์แลบ จำกัด",
  "บริษัท อินดิโก้ อินเตอร์ โปรดักส์ จำกัด",
  "บริษัท อินน์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท อินฟินิต คอสมา แลบอราทอรี จำกัด",
  "บริษัท อินฟินิตัส เฮลท์ โปรดักส์ (ไทยแลนด์) จำกัด",
  "บริษัท อินเตอร์ บิวตี้ จำกัด",
  "บริษัท อินเตอร์ เดอร์มา แลบอราทอรี จำกัด",
  "บริษัท อินเตอร์คอสเมด จำกัด",
  "บริษัท อินเตอร์ยูเนี่ยน ฟาร์มาซูติคอล จำกัด",
  "บริษัท อินเตอร์เนชั่นแนล แลบบอราทอรีส์ จำกัด",
  "บริษัท อินเวนทิโว คอสเมติก จำกัด",
  "บริษัท อินเฮิร์บ คอสเม จำกัด",
  "บริษัท อินโนคอสเมด จำกัด",
  "บริษัท อินโนวา เอสเธติค จำกัด",
  "บริษัท อินโนวาแกนซ์ ไบโอฟาร์มาซูติคอล จำกัด",
  "บริษัท อิมพีเรียล แกรนด์ อินดัสตรี จำกัด",
  "บริษัท อิมฟาสท์ (ไทยแลนด์) จำกัด",
  "บริษัท อิลลูเมีย จำกัด",
  "บริษัท อิศไบโนรา จำกัด",
  "บริษัท อิเนท โปรเกรซ จำกัด",
  "บริษัท อิไลซ่า คอสเมติกส์ จำกัด",
  "บริษัท อี เคนโกะ จำกัด",
  "บริษัท อีสคอกซ์ กรุ๊ป (ไทยแลนด์) จำกัด",
  "บริษัท อีเกิ้ลวูด 1960 (ประเทศไทย) จำกัด",
  "บริษัท อีโคเจน จำกัด",
  "บริษัท อุตสาหกรรมมิตรมงคล จำกัด",
  "บริษัท อุตสาหกรรมเครื่องหอมไทย-จีน จำกัด",
  "บริษัท อุ่นเตียม กรุ๊ป จำกัด",
  "บริษัท อโมรี่ ชาริส กรุ๊ป จำกัด",
  "บริษัท อโลเดีย จำกัด",
  "บริษัท ฮวาทรัพย์เงิน เทรดดิ้ง จำกัด",
  "บริษัท ฮอง ฟา อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท ฮอว์ลี่ย์ แอนด์ ฮาเซล เคมิคอล (ประเทศไทย) จำกัด",
  "บริษัท ฮาลาล คอสเมติก จำกัด",
  "บริษัท ฮีบิ (ไทยแลนด์) จำกัด",
  "บริษัท เกรซ 2021 จำกัด",
  "บริษัท เก็ท เฮลท์ จำกัด",
  "บริษัท เขมจิรา สกินแคร์ จำกัด",
  "บริษัท เค เอส พี คอสเมติกส์ จำกัด",
  "บริษัท เค.พี.จี เทรด เอ็นเตอร์ไพร์ส (2019) จำกัด",
  "บริษัท เค.พี.เอ็กซ์คลูซีฟ กรุ๊ป (ไทยแลนด์) จำกัด",
  "บริษัท เค.เอ็ม. อินเตอร์แล็บ จำกัด",
  "บริษัท เค.เอ็ม.อินเตอร์แล็บ จำกัด",
  "บริษัท เคช็อป จำกัด",
  "บริษัท เคดีเอ ไทย - เมียนมาร์ คอนซัลแตนท์ จำกัด",
  "บริษัท เคมไซคอส จำกัด",
  "บริษัท เคร่า คอสเมติกส์ แมนูแฟคเจอเรอร์ จำกัด",
  "บริษัท เคลียร์รา แล็บ จำกัด",
  "บริษัท เควายพี (ไทยแลนด์) จำกัด",
  "บริษัท เคเควี ซัพพลาย เชน จำกัด",
  "บริษัท เคเอเอ็น อินโนเวชั่น จำกัด",
  "บริษัท เคแลนด์ทีเอช จำกัด",
  "บริษัท เจ คอส แลบอราทอรีส์ จำกัด",
  "บริษัท เจ แอนด์ เค อินเตอร์ เนเชอรัล จำกัด",
  "บริษัท เจ.วัน คอสเมติก จำกัด",
  "บริษัท เจ.อาร์. ควอลิตี้โปรดักส์ จำกัด",
  "บริษัท เจ.เอ็ม.ที.ลาบอเรตอรีส จำกัด",
  "บริษัท เจคอส แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท เจที บิวตี้ เฮ้าท์ จำกัด",
  "บริษัท เจนิส เวิร์ลดไวด์ จำกัด",
  "บริษัท เจนเนอรี่ คอสเมติก อินโนเวชั่น จำกัด",
  "บริษัท เจย์ฌอน (ประเทศไทย) จำกัด",
  "บริษัท เจริญโภคทรัพย์ จำกัด",
  "บริษัท เจสสิริก้า จำกัด",
  "บริษัท เจแอนด์ที แฮร์ เฮิร์บ จำกัด",
  "บริษัท เชียงใหม่คอสเมติกอินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เซน โปร คอสเมติก จำกัด",
  "บริษัท เซนต์ บิวตี้ คอสเมติก (ประเทศไทย) จำกัด",
  "บริษัท เซนท์ แอนด์ เซนส์ แลบอราทอรี่ จำกัด",
  "บริษัท เซนไบโอ แลป จำกัด",
  "บริษัท เซยัน อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เซริเซ่ แมนนูแฟคเจอริ่ง (ประเทศไทย) จำกัด",
  "บริษัท เซร่า อินเตอร์เทรด จำกัด",
  "บริษัท เซียงไท้ เซอร์วิส จำกัด",
  "บริษัท เซเว่นเซฟ เอนเตอร์ไพรส์ จำกัด",
  "บริษัท เซโฟรา (ประเทศไทย) จำกัด",
  "บริษัท เซ็ต อินเตอร์เนชันนอล จำกัด",
  "บริษัท เซ็นทรัล วัตสัน จำกัด",
  "บริษัท เซ็นทรัล และ มัทสึโมโตะ คิโยชิ จำกัด",
  "บริษัท เซ็นทรัลเทรดดิ้ง จำกัด",
  "บริษัท เดอ บีลีฟแคร์ บิวตี้ แล็บ จำกัด",
  "บริษัท เดอร์มา อินโนเทค จำกัด",
  "บริษัท เดอร์มา อินโนเวชั่น จำกัด",
  "บริษัท เดอร์มา โซลูชั่น จำกัด",
  "บริษัท เดอะ รอยัล ชาร์ค เนเจอรัล เฮลท์ โปรดักส์ จำกัด",
  "บริษัท เดอะ ริช คอสแลบ จำกัด",
  "บริษัท เดอะ เดลี่แพล สี่ห้าหก จำกัด",
  "บริษัท เดอะ เนเชอรัล บิวตี้ แอนด์ คอสเมติก (ประเทศไทย) จำกัด",
  "บริษัท เดอะ เบลส อินโนเวชั่น กรุ๊ป จำกัด",
  "บริษัท เดอะ เบสท์ คอสเมติค จำกัด",
  "บริษัท เดอะ ไพร์ทอน จำกัด",
  "บริษัท เดอะซันเฮิร์บส์ แอนด์ คอสเมติกส์ จำกัด",
  "บริษัท เดอะวัน แล็บบอราเทอรีส์ จำกัด",
  "บริษัท เดอะเบสไบท์ จำกัด",
  "บริษัท เดอะเฮเว่นโฮเทลซัพพลาย จำกัด",
  "บริษัท เดอโมเวท จำกัด",
  "บริษัท เดเวอร์ แล็บ จำกัด",
  "บริษัท เทปป้า พี อินโนเวชั่น พลัส จำกัด",
  "บริษัท เทรดดิ้ง ดีไซน์ จำกัด",
  "บริษัท เนเจอรัล บิวตี้ คอสเมติกส์ จำกัด",
  "บริษัท เนเจอร์พรอฟ จำกัด",
  "บริษัท เนเจอร์อินอัส จำกัด",
  "บริษัท เนเจอร์แลบ คอสเมติค 249 จำกัด",
  "บริษัท เนเจอร์ไลน์ พลัส จำกัด",
  "บริษัท เนเชอรัล คอสเม็คส์ จำกัด",
  "บริษัท เนเชอรัล แอนด์ ออร์แกนิค แอสโซซิเอท จำกัด",
  "บริษัท เบญจคุณ สมุนไพรไทย จำกัด",
  "บริษัท เบทเตอร์ อินเวนชั่น (ประเทศไทย) จำกัด",
  "บริษัท เบทเตอร์เวย์ (ประเทศไทย) จำกัด",
  "บริษัท เบนนี่ คอสเมติค คอร์ปอเรชั่น จำกัด",
  "บริษัท เบล เอ็นเอ็น บริลเลียน จำกัด",
  "บริษัท เบลซ เอเชีย จำกัด",
  "บริษัท เพรสติก โพรดักส์ (ประเทศไทย) จำกัด",
  "บริษัท เพรสทีจ ซีเลคชั่น จำกัด",
  "บริษัท เพลินไพร ออร์แกนิค จำกัด",
  "บริษัท เพอเฟคท์ ไลน์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เพียว คอสเมติก แลบบอราทอรีส์ จำกัด",
  "บริษัท เพียว เดอริมา แลบบอราทอรีส์ จำกัด",
  "บริษัท เพียวริตี้ แล็บ จำกัด",
  "บริษัท เพียวไลฟ์เอ็นเตอร์ไพรส์ จำกัด",
  "บริษัท เพียส อินเตอร์คอสเม็กซ์ (ประเทศไทย) จำกัด",
  "บริษัท เฟซ แอนด์ อีทีซี เทรดดิ้ง จำกัด",
  "บริษัท เฟิร์ส เอด คิส แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท เฟิสต์ ฟลอร่า จำกัด",
  "บริษัท เภสัชกรรมนครพัฒนา จำกัด",
  "บริษัท เมก้า คอสเมติก (ประเทศไทย) จำกัด",
  "บริษัท เมค เซนท์ส จำกัด",
  "บริษัท เมคอัพอาร์ต จำกัด",
  "บริษัท เมคัง เซ็นจูรี่ จำกัด",
  "บริษัท เมดดิซาย อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เมดิคอส จำกัด",
  "บริษัท เมนคอสต้า แลบ จำกัด",
  "บริษัท เมย์ซี อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เมย์ยูเม แมนูแฟคเจอริ่ง (ประเทศไทย) จำกัด",
  "บริษัท เมอร์คิวรี่ ไมโคร เทคโนโลยี จำกัด",
  "บริษัท เมอร์รี่ คอสเมติก แลบบอราทอรีส์ จำกัด",
  "บริษัท เมอิโก้ กรุ๊ป โฮลดิ้งส์ จำกัด",
  "บริษัท เยส คัม (ไทยแลนด์) จำกัด",
  "บริษัท เรด ออเรนจ์ ดิสทริบิวชั่น จำกัด",
  "บริษัท เลอ เกรท (ไทยแลนด์) จำกัด",
  "บริษัท เลอ โซรี่ กรุ๊ป จำกัด",
  "บริษัท เลอนิท อินเตอร์ จำกัด",
  "บริษัท เลิศอนันต์ อินเตอร์เนชั่น โซป จำกัด",
  "บริษัท เลเจนด์ อ๊อฟ โปรดักส์ จำกัด",
  "บริษัท เล็ก จำกัด",
  "บริษัท เวก้าเนเจอรัล จำกัด",
  "บริษัท เวลตี้ เวล คอสเมด จำกัด",
  "บริษัท เวิลด์ คอสเม็กซ์ เอ็นเตอร์ไพรส์ จำกัด",
  "บริษัท เว่ย โค๋ จี จำกัด",
  "บริษัท เสริมพิสิทธิ์ จำกัด",
  "บริษัท เอ นิว เคมิคอล จำกัด",
  "บริษัท เอ วาย เอ็น จำกัด",
  "บริษัท เอ วี ปารีสเพอร์ฟูม จำกัด",
  "บริษัท เอ เอส ซี ลาโบลาโทรี่ จำกัด",
  "บริษัท เอ.พี. ฟาร์ม่า จำกัด",
  "บริษัท เอ.เค คอสเมติก อินโนเวชั่น จำกัด",
  "บริษัท เอ.เอ็ม.พี อินโนเวชั่น อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เอซ พรีม (เอเชีย) จำกัด",
  "บริษัท เอดีเอ คอสเมติคส์ อินเตอร์เนชั่นแนล (ประเทศไทย) จำกัด",
  "บริษัท เอพี เนเชอร์รัล โปรดักส์ จำกัด",
  "บริษัท เอฟ.ซี.พี. จำกัด",
  "บริษัท เอฟซี ลาบอราทอรี่ จำกัด",
  "บริษัท เอฟเวอร์ เฮลธ์ (ประเทศไทย) จำกัด",
  "บริษัท เอมเมลล่าส์ คอร์เนอร์ จำกัด",
  "บริษัท เอลก้า (ประเทศไทย) จำกัด",
  "บริษัท เอลเคน (ประเทศไทย) จำกัด",
  "บริษัท เอลโซล โปรดักส์ (ไทยแลนด์) จำกัด",
  "บริษัท เอส ที เอส คอนซูเมอร์ โปรดักส์ จำกัด",
  "บริษัท เอส บี พี แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท เอส บี อินเตอร์แลบ จำกัด",
  "บริษัท เอส พี คอสเมติค ดีไซน์ จำกัด",
  "บริษัท เอส วี เอส อินโนเทค จำกัด",
  "บริษัท เอส แอนด์ เจ อินเตอร์เนชั่นแนล เอนเตอร์ไพรส์ จำกัด (มหาชน)",
  "บริษัท เอส.พี.วาย.คอสเมติก จำกัด",
  "บริษัท เอส.แอล.เอ็น. อินเตอร์แล็บ จำกัด",
  "บริษัท เอสจี คอสเมติค จำกัด",
  "บริษัท เอสซีจี แกรนด์ คอสเมติคส์ จำกัด",
  "บริษัท เอสดีเอ็กซ์ อินโนเวชั่น จำกัด",
  "บริษัท เอสทีเอส แนชเชอรัล โปรดักส์ จำกัด",
  "บริษัท เอสพีซี คอสเมติก จำกัด",
  "บริษัท เอสเคโอเอ็นเอ็กซ์ เพอร์ฟูมเมอรี่ จำกัด",
  "บริษัท เอสเท่แคร์ คอสเมซูทิคอล แอนด์ ซัพพลีเมนทารี่ จำกัด",
  "บริษัท เอสเธติค พลัส จำกัด",
  "บริษัท เอสเธทิค แล็บ แอนด์ ดีเวลลอปเม้นท์ จำกัด",
  "บริษัท เอสเอสเค คอนซัลติ้ง จำกัด",
  "บริษัท เอสแอล คอสเมติก จำกัด",
  "บริษัท เออีซี รีซอร์สเซส ดีเวลลอปเม้นท์ จำกัด",
  "บริษัท เอิร์ธ แฟคเทอรี่ จำกัด",
  "บริษัท เอียม พรอฟ จำกัด",
  "บริษัท เอเค เฮลท์ตี้ โปร จำกัด",
  "บริษัท เอเชีย อีโค่ คอร์ป จำกัด",
  "บริษัท เอเซียแมค พียู จำกัด",
  "บริษัท เอเรคี จำกัด",
  "บริษัท เอเวอร์แคร์ จำกัด",
  "บริษัท เอเอสแล็บ จำกัด",
  "บริษัท เอแอนด์เจ บิวตี้โปรดักส์ จำกัด",
  "บริษัท เอ็น-เพล็กซ์ โกลบอล จำกัด",
  "บริษัท เอ็นแอนด์เค แลบบอราทอรี่ จำกัด",
  "บริษัท เอ็นแอลซี คอสเมติคส์ จำกัด",
  "บริษัท เอ็ม คิวเรเท็ด จำกัด",
  "บริษัท เอ็ม จี ที อินเตอร์คอร์ปอเรชั่น จำกัด",
  "บริษัท เอ็ม ซี ไอ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท เอ็ม พลัส วัน เน็ตเวิร์ค มีเดีย จำกัด",
  "บริษัท เอ็ม-โฮม กรุ๊ป จำกัด",
  "บริษัท เอ็ม.วาย.อาร์.คอสเมติคส์ โซลูชั่น จำกัด",
  "บริษัท เอ็ม.เอส. เฟริสท์ เอ็นเตอร์ไพรส์ จำกัด",
  "บริษัท เอ็ม.เอส.ยูเนียน เอ็นเตอร์ไพร์ส จำกัด",
  "บริษัท เอ็มซีเค ฟาร์มาซูติคัล จำกัด",
  "บริษัท เอ็มที เนเชอรอล เฮิร์บ จำกัด",
  "บริษัท เอ็มพาวเวอร์ริ่ง อินโนเวชั่นส์ จำกัด",
  "บริษัท เอ็มพีซี อินโนเวชั่น แลบ จำกัด",
  "บริษัท เอ็มเอฟ คอสเมท จำกัด",
  "บริษัท เอ็มเอ็มเอ็ม คอสมีเทค จำกัด",
  "บริษัท เอ็มไอเอ็ม คอสแล็บ แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท เฮงเค็ล (ประเทศไทย) จำกัด",
  "บริษัท เฮย์ กรุ๊ป 5785 จำกัด",
  "บริษัท เฮลท์ แอนด์ เดอร์มา คอสเมติค จำกัด",
  "บริษัท เฮลท์ตี้ออร์แกนิคฟาร์ม จำกัด",
  "บริษัท เฮลท์ฟู้ด แอนด์ คอสเมติค ครีเอชั่น จำกัด",
  "บริษัท เฮลธ์ โซลูชั่น จำกัด",
  "บริษัท เฮลธ์แอนด์แฮปปี้เนส (เอชแอนด์เอช) (ไทยแลนด์) จำกัด",
  "บริษัท เฮอร์บาเรียม จำกัด",
  "บริษัท เฮอเบิล สกิน จำกัด",
  "บริษัท เฮิร์บ เบสิคส์ จำกัด",
  "บริษัท เฮิร์บส์ บิวตี้ คอร์ปอเรชั่น จำกัด",
  "บริษัท เฮิร์บแคร์นภา จำกัด",
  "บริษัท เฮ้าส์ออฟโซป(ไทยแลนด์) จำกัด",
  "บริษัท แกรนด์ คอส กรุ๊ป จำกัด (มหาชน)",
  "บริษัท แคร์ซูติก จำกัด",
  "บริษัท แฉล้ม ไทย เฮิร์บ จำกัด",
  "บริษัท แทนธันเดอร์ จำกัด",
  "บริษัท แทมป์ คอสเมติก จำกัด",
  "บริษัท แบงค็อก เพอร์ฟูม แอนด์ คอสเมติก จำกัด",
  "บริษัท แพคท์ โพรดักส์ จำกัด",
  "บริษัท แพทย์สะอาด แลบ จำกัด",
  "บริษัท แฟชั่น คิงดอม จำกัด",
  "บริษัท แฟชั่น โดย ณริดา จำกัด",
  "บริษัท แฟนบิวตี้ จำกัด",
  "บริษัท แมนดอมคอร์ปอเรชั่น (ประเทศไทย) จำกัด",
  "บริษัท แม่ทัพ เทรดดิ้ง จำกัด",
  "บริษัท แรร์โกลล์ จำกัด",
  "บริษัท แลโบทานิก ออแกนิค บิวตี้ จำกัด",
  "บริษัท แล็บ ซิส สกิน จำกัด",
  "บริษัท แล็บ สกินแคร์ จำกัด",
  "บริษัท แล็บ แอนด์ บิวตี้ จำกัด",
  "บริษัท แวนน์ คอสเมติกส์ แอนด์ แลบอราทอรี่ จำกัด",
  "บริษัท แองเจิ้ล ชายน์ คอสเมติก จำกัด",
  "บริษัท แอจไจล์ เซอร์วิสเซส จำกัด",
  "บริษัท แอดวานซ์ เอนริชเชส จำกัด",
  "บริษัท แอดว๊านส์ คอสเมติคส์ จำกัด",
  "บริษัท แอบโซลูท เรซิพี แอนด์ คอสเมติก จำกัด",
  "บริษัท แอปเปิ้ล เอ็นเตอร์ไพรซ์ จำกัด",
  "บริษัท แอมเวย์ (ประเทศไทย) จำกัด",
  "บริษัท แอล ที จี เทรดดิ้ง จำกัด",
  "บริษัท แอล.เอ. เดอร์มาเทค จำกัด",
  "บริษัท แอล.เอ็ม.เค.พี จำกัด",
  "บริษัท แอลจี เฮ้าส์โฮลด์ แอนด์ เฮลธ์ แคร์ (ประเทศไทย) จำกัด",
  "บริษัท แอลเอสเอ็ม สกินแคร์ จำกัด",
  "บริษัท แอสทริด ลาบัว จำกัด",
  "บริษัท แอ๊พ ท๊อปเวิลด์ จำกัด",
  "บริษัท แฮค แล็บ จำกัด",
  "บริษัท แฮร์รอดส์ อินเตอร์เทรด จำกัด",
  "บริษัท โกรวี่ ฟู้ด จำกัด",
  "บริษัท โกรว์ เอสเธติก จำกัด",
  "บริษัท โกลบอล ฟาซาด ซีสเต็มส์ จำกัด",
  "บริษัท โกลบอล อินสไปร์ แลบบอราทอรีส์ จำกัด",
  "บริษัท โกลบอล เมดดิคัล (ประเทศไทย) จำกัด",
  "บริษัท โกลบอล เอเซีย บิซ เซ็นเตอร์ จำกัด",
  "บริษัท โกลเด้น แอพพรีชีเอชั่น จำกัด",
  "บริษัท โคตี้ โอเปอเรชั่นส์ (ประเทศไทย) จำกัด",
  "บริษัท โคลเอ้ โรส จำกัด",
  "บริษัท โควิก เคทท์ อินเตอร์เนชั่นแนล (ประเทศไทย) จำกัด",
  "บริษัท โคะโคโระ ซาโตะ จำกัด",
  "บริษัท โคเซ่ (ประเทศไทย) จำกัด",
  "บริษัท โคเรีย กู๊ดส์ จำกัด",
  "บริษัท โคโค่เมติกส์ จำกัด",
  "บริษัท โช แลบอราทอรี จำกัด",
  "บริษัท โซบิวตี้ จำกัด",
  "บริษัท โซพราโนส (ไทยแลนด์) จำกัด",
  "บริษัท โตโย ฟิลลิ่ง อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท โทฟู สกินแคร์ จำกัด",
  "บริษัท โนโลจี เดอร์มา แคร์ จำกัด",
  "บริษัท โบเซนด โคลธธิง จำกัด",
  "บริษัท โปร คอสเมติกส์ แลบ จำกัด",
  "บริษัท โปรโนวา แลบบอราทอรีส์ จำกัด",
  "บริษัท โพรเวนซ์ คอสเมดิกซ์ จำกัด",
  "บริษัท โพสเฮลท์แคร์ จำกัด",
  "บริษัท โฟร์ แลบบอราทอรีส์ จำกัด",
  "บริษัท โมริโตโม (ประเทศไทย) จำกัด",
  "บริษัท โมลา คอสเมท จำกัด",
  "บริษัท โมเดิรน์คาส อินเตอร์เนชั่นแนล คอสเมติคส์ จำกัด",
  "บริษัท โรจูคิส อินเตอร์เนชั่นแนล จำกัด (มหาชน)",
  "บริษัท โรนาร์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท โรห์โต้-เมนโทลาทั่ม (ประเทศไทย) จำกัด",
  "บริษัท โหยว ไท่ คอสเมติกส์ อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท โอ ซี ซี จำกัด (มหาชน)",
  "บริษัท โอ มาย เทรดดิ้ง จำกัด",
  "บริษัท โอท๊อป-มาดเท่ จำกัด",
  "บริษัท โอนิกซ์ เทค จำกัด",
  "บริษัท โอมาเซ่ เทรดดิ้ง จำกัด",
  "บริษัท โอร่าเมด จำกัด",
  "บริษัท โอเค รีเทล กรุ๊ป จำกัด",
  "บริษัท โอเคยะ (ไทยแลนด์) จำกัด",
  "บริษัท โอเรียนทัล อโรม่า จำกัด",
  "บริษัท โอโอทรี บิวตี้เซ็นเตอร์ จำกัด",
  "บริษัท โฮมสกิน แลบบอราทอรี่ จำกัด",
  "บริษัท ไชนิ่ง แลบบอราทอรี่ จำกัด",
  "บริษัท ไซเนเจอร์ แมนูแฟคเจอริ่ง(ประเทศไทย) จำกัด",
  "บริษัท ไซเบอร์แพค จำกัด",
  "บริษัท ไซเอนซ์ วิสดอม จำกัด",
  "บริษัท ไซเอนซ์ อินโนเวทีฟ โปรดักส์ จำกัด",
  "บริษัท ไดมอนด์ สกินแคร์ช็อป จำกัด",
  "บริษัท ไดอารี่ กรุ๊ป (2007) จำกัด",
  "บริษัท ไทย-มีโก้ จำกัด",
  "บริษัท ไทยคลีน คอสเมติก จำกัด",
  "บริษัท ไทยนาโนเซลลูโลส จำกัด",
  "บริษัท ไทยบิซอินเตอร์โปรดักส์ จำกัด",
  "บริษัท ไทยโบทานิคแล็บ จำกัด",
  "บริษัท ไทล่า เทรดดิ้ง จำกัด",
  "บริษัท ไบเออร์สด๊อรฟ (ประเทศไทย) จำกัด",
  "บริษัท ไบโอ คอสเมติค กรุ๊ป จำกัด",
  "บริษัท ไบโอ ฟาร์มาซูติคอล แล็บ จำกัด",
  "บริษัท ไฟน์ ทูเดย์ (ไทยแลนด์) จำกัด",
  "บริษัท ไฟน์ ไบโอ เทคโนโลยี จำกัด",
  "บริษัท ไมลอทท์ แลบบอราทอรีส์ จำกัด",
  "บริษัท ไมเบล แลบบอราทอรีส์ จำกัด",
  "บริษัท ไลอ้อน (ประเทศไทย) จำกัด",
  "บริษัท ไวซ์ มังกี้ เทรด จำกัด",
  "บริษัท ไวท์ แคร์ สกินแคร์ แอนด์ คอสเมติก จำกัด",
  "บริษัท ไวท์เฮ้าส์ คอสเม่ จำกัด",
  "บริษัท ไวลด์ สกิน อินเตอร์เนชั่นแนล จำกัด",
  "บริษัท ไวส์พลัสโกร จำกัด",
  "บริษัท ไห่จี เทรดดิ้ง (ไทยแลนด์) จำกัด",
  "บริษัท ไอ พลัส คิว จำกัด",
  "บริษัท ไอ เรียล พลัส (ประเทศไทย) จำกัด",
  "บริษัท ไอ แอม สกิน จำกัด",
  "บริษัท ไอ.ซี.แล็บบอราทอรี่ส์ จำกัด",
  "บริษัท ไอซี อินโนเทค แลบบอราทอรีส์ จำกัด",
  "บริษัท ไอซีที แมนูแฟคเจอริ่ง จำกัด",
  "บริษัท ไอดร้า บิวตี้ จำกัด",
  "บริษัท ไอดี คอสเมด โซลูชั่นส์ จำกัด",
  "บริษัท ไอดีว่า กรุ๊ป จำกัด",
  "บริษัท ไอพลัส แลบบอราทอรี่ จำกัด",
  "บริษัท ไอยู-คอสเมด กรุ๊ป จำกัด",
  "บริษัท ไอเซอร์วิสเน็ต จำกัด",
  "บริษัท ไอเดีย สแควร์แลบอราทอรี่ส์ จำกัด",
  "บริษัท ไอเดีย แมทเทอ จำกัด",
  "บริษัท ไอเดีย โซพ (ไทยแลนด์) จำกัด",
  "บริษัท ไอเดียล แอพโพรช จำกัด",
  "บริษัทจำกัด เอ.โอ.เอ็ม.คอสเมติกส์(ไทยแลนด์) จำกัด",
  "มหาวิทยาลัย มหิดล คณะเภสัชศาสตร์ ฟาร์มท็อป",
  "มหาวิทยาลัย เทคโนโลยีราชมงคลธัญบุรี",
  "มหาวิทยาลัยมหาสารคาม ฟาร์มแคร์คอสเมซูติคอล",
  "มหาวิทยาลัยแม่ฟ้าหลวง",
  "วิสาหกิจชุมชน จื่นใจ๋",
  "วิสาหกิจชุมชน บ้านสมุนไพรและของดีบางแขยง",
  "วิสาหกิจชุมชน ผลิตภัณฑ์จากผึ้งป่าก๋อย",
  "วิสาหกิจชุมชน ฟาร์มสเตย์บ้านตึก",
  "วิสาหกิจชุมชน ภูวารา",
  "วิสาหกิจชุมชน ยาสีฟันสมุนไพรเอนไซม์เฮิร์บ บุปผาวัน",
  "วิสาหกิจชุมชน สมุนไพรเพื่อสุขภาพบ้านโพธิ์รังนก",
  "วิสาหกิจชุมชน สาลีนา สปา โพรดักส์",
  "วิสาหกิจชุมชน เต่ามงคล",
  "วิสาหกิจชุมชนเกษตรแปรรูปเมืองสระแก้ว",
  "วิสาหกิจชุมชนเรือนสมุทร 2",
  "วิสาหกิจชุมชนเรือนไม้หอม",
  "สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยีแห่งประเทศไทย",
  "สำนักงานคณะกรรมการพิเศษเพื่อประสานงานโครงการอันเนื่องมาจากพระราชดำริ",
  "หจก.สปริงกรีน",
  "ห้างหุ้นส่วนจำกัด 818 คอสเมติกา",
  "ห้างหุ้นส่วนจำกัด คอสมิค แล็บ",
  "ห้างหุ้นส่วนจำกัด คอสเมติก แลบบอราทอรีส์",
  "ห้างหุ้นส่วนจำกัด จัตุรงค์คูลลิ่ง",
  "ห้างหุ้นส่วนจำกัด ชนานันท์ คอสเมติก",
  "ห้างหุ้นส่วนจำกัด ชวนชม เดอะเบสท์",
  "ห้างหุ้นส่วนจำกัด ซิกส์ทีม เนเชอรัล โปรดักส์",
  "ห้างหุ้นส่วนจำกัด ดิ อโรม่า บาร์ (ไทยแลนด์)",
  "ห้างหุ้นส่วนจำกัด ดีมี อินเตอร์กรุ๊ป",
  "ห้างหุ้นส่วนจำกัด ที.อาร์.เอ.",
  "ห้างหุ้นส่วนจำกัด บีลีฟ เนเชอรัล คอสเมติคส์ เอฟ แอนด์ เอ็น",
  "ห้างหุ้นส่วนจำกัด บ้านสกุลวารีคอสเมติค",
  "ห้างหุ้นส่วนจำกัด ปรางทอง คอสเมติก",
  "ห้างหุ้นส่วนจำกัด พีพี ชาร์มมิ่ง สกินแคร์",
  "ห้างหุ้นส่วนจำกัด ฟาร์มผึ้งพัฒนกิจ",
  "ห้างหุ้นส่วนจำกัด ภีรดา คอสเมติกส์",
  "ห้างหุ้นส่วนจำกัด วี แคร์ พลัส",
  "ห้างหุ้นส่วนจำกัด สกุณาซิลค์",
  "ห้างหุ้นส่วนจำกัด สยามจันทร์นินทร์",
  "ห้างหุ้นส่วนจำกัด สวัสดี จีเนียส",
  "ห้างหุ้นส่วนจำกัด สุปราณี โซป",
  "ห้างหุ้นส่วนจำกัด เค คอสเมด เทรดดิ้ง",
  "ห้างหุ้นส่วนจำกัด เดอร์มาเด็กซ์ (ประเทศไทย)",
  "ห้างหุ้นส่วนจำกัด เนธิรินทร์",
  "ห้างหุ้นส่วนจำกัด เนเจอร์ เมค เซ้นท์",
  "ห้างหุ้นส่วนจำกัด เนเจอร์ซอฟต์",
  "ห้างหุ้นส่วนจำกัด เบญจฤทธิ์ บิซิเนส",
  "ห้างหุ้นส่วนจำกัด เฮอเบิล ไทย",
  "ห้างหุ้นส่วนจำกัด แสงโขง",
  "ห้างหุ้นส่วนจำกัด โซปปี้ แอนด์ แพเร็นท์",
  "ห้างหุ้นส่วนจำกัด โมโฮลิคโซป",
  "ห้างหุ้นส่วนจำกัด โรสทิพย์ การ์เด้นท์",
  "ห้างหุ้นส่วนจำกัด โอเจ สกินแคร์ เซ็นเตอร์",
  "ห้างหุ้นส่วนจำกัด ไลฟ์ เอ็กซิท",
  "ห้างหุ้นส่วนจำกัด ไฮพาส",
  "ห้างหุ้นส่วนสามัญ ควินเทท เอเชีย",
  "ห้างหุ้นส่วนสามัญ รัตนณิฐาพรภัณฑ์"
]